#pragma once

namespace KURS
{
	enum class Currency:int
	{
		UNW=0,//не установленно
		//основные валюты
		USD,//доллар США
		EUR,//Евро
		RUB,//российских рублей
		UAH,//украинская гривна
		GBP,//фунтов стерлингов Великобритании
		PLN,//польских злотых
		MDL,//молдавских леев
		BYN,//белорусских рублей
		CNY,//китайских юаней женьминьби	
		TRY,//новых турецких лир	
		//1 группа
		AUD,//австралийских долларов	
		AZN,//азербайджанских манатов		
		CAD,//канадских долларов
		CHF,//швейцарских франков	
		CZK,//чешских крон	
		DKK,//датских крон	
		HUF,//венгерских форинтов	
		ISK,//исландских крон
		JPY,//японских йен	
		KZT,//казахских тенге		
		NOK,//норвежских крон	
		SEK,//шведских крон	
		SGD,//сингапурских долларов	
		TMT,//туркменских манатов	
		UZS,//узбекских сумов	
		XDR,//СПЗ
		//2 группа
		AMD,//армянских драмов	
		BGN,//болгарских левов	
		BRL,//бразильских реалов	
		CLP,//чилийских песо	
		EGP,//египетских фунтов	
		GEL,//грузинских лари	
		HKD,//гонконгских долларов	
		HRK,//хорватских кун	
		ILS,//израильских шекелей	
		INR,//индийских рупий	
		IQD,//иракских динаров	
		IRR,//иранских риалов	
		KGS,//киргизских сомов	
		KRW,//южно - корейских вон(Корея)
		KWD,//кувейтских динаров	
		LBP,//ливанских фунтов	
		LYD,//ливийских динаров	
		MNT,//монгольских тугриков	
		MXN,//мексиканских песо	
		NZD,//новозеландских долларов	
		PEN,//перуанских солей	
		PKR,//пакистанских рупий	
		RON,//новых румынских леев	
		SAR,//саудовских риялов	
		SYP,//сирийских фунтов	
		TJS,//таджикских сомони	
		TWD,//тайваньских долларов	
		VND,//вьетнамских донгов	
		XOF//франков КФА(Западная Африка)	
	};

}
